<?php

declare(strict_types=1);

/**
 *  PTAdmin
 *  ============================================================================
 *  版权所有 2022-2024 重庆胖头网络技术有限公司，并保留所有权利。
 *  网站地址: https://www.pangtou.com
 *  ----------------------------------------------------------------------------
 *  尊敬的用户，
 *     感谢您对我们产品的关注与支持。我们希望提醒您，在商业用途中使用我们的产品时，请务必前往官方渠道购买正版授权。
 *  购买正版授权不仅有助于支持我们不断提供更好的产品和服务，更能够确保您在使用过程中不会引起不必要的法律纠纷。
 *  正版授权是保障您合法使用产品的最佳方式，也有助于维护您的权益和公司的声誉。我们一直致力于为客户提供高质量的解决方案，并通过正版授权机制确保产品的可靠性和安全性。
 *  如果您有任何疑问或需要帮助，我们的客户服务团队将随时为您提供支持。感谢您的理解与合作。
 *  诚挚问候，
 *  【重庆胖头网络技术有限公司】
 *  ============================================================================
 *  Author:    Zane
 *  Homepage:  https://www.pangtou.com
 *  Email:     vip@pangtou.com
 */

use Illuminate\Support\Str;

return [
    /*
    |--------------------------------------------------------------------------
    | 默认 `Session` 驱动程序
    |--------------------------------------------------------------------------
    |
    | 支持: "file", "cookie", "database", "apc", "memcached", "redis", "dynamodb", "array"
    |
    */
    'driver' => env('SESSION_DRIVER', 'file'),

    /*
    |--------------------------------------------------------------------------
    | Session 有效时间
    |--------------------------------------------------------------------------
    */
    'lifetime' => env('SESSION_LIFETIME', 120),
    'expire_on_close' => false,

    /*
    |--------------------------------------------------------------------------
    | Session 加密
    |--------------------------------------------------------------------------
    */

    'encrypt' => false,

    /*
    |--------------------------------------------------------------------------
    | Session 文件位置
    |--------------------------------------------------------------------------
    |
    | 当使用本地驱动时，所有会话文件都将存储在此处。已为您设置了默认值，但可以指定不同的位置。
    |
    */
    'files' => storage_path('framework/sessions'),

    /*
    |--------------------------------------------------------------------------
    | Session 数据库链接
    |--------------------------------------------------------------------------
    |
    | 当使用 "database" 或 "redis" 驱动时指定的数据库连接。
    |
    */
    'connection' => env('SESSION_CONNECTION', null),

    /*
    |--------------------------------------------------------------------------
    | Session 数据库表名称
    |--------------------------------------------------------------------------
    |
    | 当使用 database 驱动时，数据库对应表名称
    |
    */
    'table' => 'sessions',

    /*
    |--------------------------------------------------------------------------
    | Session 缓存存储
    |--------------------------------------------------------------------------
    |
    | 当使用缓存作为驱动时指定的缓存存储。
    | Affects: "apc", "dynamodb", "memcached", "redis"
    |
    */
    'store' => env('SESSION_STORE', null),

    /*
    |--------------------------------------------------------------------------
    | 幸运抽奖
    |--------------------------------------------------------------------------
    |
    | 部分 Session 驱动 需要手动清理过期的 Session 数据，如（文件、数据库驱动）.这个过程叫会话清理
    | 会话清理的时候：会根据请求有一定概率触发会话清理，这个概率是由 lottery 决定。
    | 默认情况下，清理概率为 2%，即每 100 次请求中有 2 次会触发会话清理。
    |
    */
    'lottery' => [2, 100],

    /*
    |--------------------------------------------------------------------------
    | Session cookie 名称
    |--------------------------------------------------------------------------
    */
    'cookie' => env(
        'SESSION_COOKIE',
        Str::slug(env('APP_NAME', 'laravel'), '_').'_ptadmin_session'
    ),

    /*
    |--------------------------------------------------------------------------
    | Session cookie路径
    |--------------------------------------------------------------------------
    */
    'path' => '/',

    /*
    |--------------------------------------------------------------------------
    | Session Cookie 域
    |--------------------------------------------------------------------------
    */
    'domain' => env('SESSION_DOMAIN', null),

    /*
    |--------------------------------------------------------------------------
    | HTTPS Only Cookies
    |--------------------------------------------------------------------------
    */
    'secure' => env('SESSION_SECURE_COOKIE'),

    /*
    |--------------------------------------------------------------------------
    | HTTP Access Only
    |--------------------------------------------------------------------------
    */
    'http_only' => true,

    /*
    |--------------------------------------------------------------------------
    | Same-Site Cookies
    |--------------------------------------------------------------------------
    | Supported: "lax", "strict", "none", null
    |
    */
    'same_site' => 'lax',
];
